docs/jmeter/report-20260406-172606/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4,
    "errorCount" : 1,
    "errorPct" : 25.0,
    "meanResTime" : 51.75,
    "medianResTime" : 32.0,
    "minResTime" : 0.0,
    "maxResTime" : 143.0,
    "pct1ResTime" : 143.0,
    "pct2ResTime" : 143.0,
    "pct3ResTime" : 143.0,
    "throughput" : 18.867924528301884,
    "receivedKBytesPerSec" : 12.308372641509434,
    "sentKBytesPerSec" : 1.8932414504716981
  },
  "查看历史聊天" : {
    "transaction" : "查看历史聊天",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 36.0,
    "medianResTime" : 36.0,
    "minResTime" : 36.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 36.0,
    "pct3ResTime" : 36.0,
    "throughput" : 27.777777777777775,
    "receivedKBytesPerSec" : 7.703993055555556,
    "sentKBytesPerSec" : 3.7163628472222223
  },
  "查任务列表" : {
    "transaction" : "查任务列表",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : "Infinity",
    "receivedKBytesPerSec" : "Infinity",
    "sentKBytesPerSec" : "NaN"
  },
  "获取已上传的主题" : {
    "transaction" : "获取已上传的主题",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.0,
    "medianResTime" : 28.0,
    "minResTime" : 28.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 28.0,
    "throughput" : 35.714285714285715,
    "receivedKBytesPerSec" : 12.416294642857142,
    "sentKBytesPerSec" : 4.673549107142857
  },
  "获取所有的历史会话列表" : {
    "transaction" : "获取所有的历史会话列表",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 143.0,
    "medianResTime" : 143.0,
    "minResTime" : 143.0,
    "maxResTime" : 143.0,
    "pct1ResTime" : 143.0,
    "pct2ResTime" : 143.0,
    "pct3ResTime" : 143.0,
    "throughput" : 6.993006993006993,
    "receivedKBytesPerSec" : 5.613527097902098,
    "sentKBytesPerSec" : 0.9560751748251749
  }
}